import React from 'react';

const PrivacyPolicy = () => {
    return (
        <div style={{ color: '#fff', padding: '20px', fontSize: '12px' }}>
            <h1>隐私协议</h1>
            <p>最后更新日期：2025年2月16日</p>

            <h2>1. 信息收集</h2>
            <p>
                在使用我们的服务时，我们可能会收集您的个人信息，包括但不限于您的姓名、电子邮件地址、设备信息等。这些信息将用于提供和改善我们的服务。
            </p>

            <h2>2. 信息使用</h2>
            <p>我们收集的信息将用于以下目的：</p>
            <ul>
                <li>提供和优化我们的服务</li>
                <li>向您发送重要通知和更新</li>
                <li>改进用户体验和应用功能</li>
            </ul>

            <h2>3. 信息共享</h2>
            <p>我们不会将您的个人信息出售、出租或分享给第三方，除非出于以下目的：</p>
            <ul>
                <li>法律要求或政府要求</li>
                <li>为了保护我们的权利或财产</li>
                <li>在应用功能或合作伙伴需要的情况下</li>
            </ul>

            <h2>4. 数据安全</h2>
            <p>
                我们采取合理的技术和组织措施来保护您的个人信息不被未经授权的访问、披露、修改或销毁。然而，请注意，任何通过互联网传输的方式都无法做到100%的安全保障。
            </p>

            <h2>5. 第三方链接</h2>
            <p>
                我们的应用可能包含指向第三方网站或服务的链接。我们不控制这些第三方网站的内容和隐私政策，因此不对其负责。
            </p>

            <h2>6. 儿童隐私</h2>
            <p>
                本应用不针对13岁以下的儿童。如果我们得知收集了儿童的个人信息，我们会尽快删除相关数据。
            </p>

            <h2>7. 用户权利</h2>
            <p>
                您有权访问、更正或删除我们收集的您的个人信息。如果您希望行使这些权利，请通过邮箱[amliubo@163.com]联系我们。
            </p>

            <h2>8. 同意和修改</h2>
            <p>
                使用本应用即表示您同意我们收集、使用和分享您的个人信息。如果我们对本隐私协议进行修改，我们将在本页面更新相关内容。请定期查看本协议。
            </p>

            <h2>9. 联系我们</h2>
            <p>如果您对本隐私协议有任何疑问或需要进一步了解，请通过以下方式与我们联系：</p>
            <ul>
                <li>电子邮件: amliubo@163.com</li>
            </ul>
        </div>
    );
}

export default PrivacyPolicy;
